In [34]:
import pandas as pd

In [35]:
df = pd.read_csv("dataset.tsv", sep="\t", header=0)
df

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [36]:
df.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [37]:
df.Birth = df.Birth.apply(pd.to_datetime)
df

C:\Users\Artem\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\apply.py:1137: UserWarning: Parsing '22.03.1980' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  mapped = lib.map_infer(
C:\Users\Artem\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\apply.py:1137: UserWarning: Parsing '13.02.1980' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  mapped = lib.map_infer(
C:\Users\Artem\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\apply.py:1137: UserWarning: Parsing '15.04.1985' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  mapped = lib.map_infer(
C:\Users\Artem\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\apply.py:1137: UserWarning: Parsing '19.11.1985' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  mapped = lib.map_infer(
C:\Users\Artem\AppData\Local\Programs\Python\Python310\lib\site-packages\pandas\core\apply.py:1137: UserWarning: Parsing '31.05.1985' in DD/MM/YYYY format. Provide format or specify infer_datetime_format=True for consistent parsing.
  mapped = lib.map_infer(

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [38]:
df.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Birth     6 non-null      datetime64[ns]
 2   City      6 non-null      object
 3   Position  4 non-null      object
dtypes: datetime64[ns](1), object(3)
memory usage: 320.0+ bytes

In [40]:
df.Position = df.Position.fillna("разнорабочий")
df

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [41]:
df.Position

0    разнорабочий
1         инженер
2        менеджер
3    разнорабочий
4         инженер
5          стажер
Name: Position, dtype: object

In [42]:
df[['Position']]

       Position
0  разнорабочий
1       инженер
2      менеджер
3  разнорабочий
4       инженер
5        стажер

In [43]:
df[['Name', 'Position']]

              Name      Position
0      Иванов А.А.  разнорабочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разнорабочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [44]:
df.head()

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разнорабочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер

In [45]:
df[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разнорабочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [58]:
df.loc[[1,3,5], ["Name", "City"]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [59]:
df.iloc[[1,3,5], [0,2]]

              Name       City
1     Сорокин И.В.  Волгоград
3  Мельникова Д.С.     Ростов
5     Костров С.О.     Москва

In [64]:
import datetime as dt
df[df.Birth >= dt.datetime(1985,1,1)]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [67]:
df[(df.Birth >= dt.datetime(1985,1,1)) & (df.City != "Москва")]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разнорабочий

In [69]:
df[(df.Birth >= dt.datetime(1985,1,1)) | (df.City == "Волгоград")]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разнорабочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер